x1=float(input("Введите координату вершины треугольника x1: "))
y1=float(input("Введите координату вершины треугольника y1: "))
x2=float(input("Введите координату вершины треугольника x2: "))
y2=float(input("Введите координату вершины треугольника y2: "))
x3=float(input("Введите координату вершины треугольника x3: "))
y3=float(input("Введите координату вершины треугольника y3: "))
a=((x2-x1)**2 + (y2-y1)**2)**0.5
b=((x3-x2)**2 + (y3-y2)**2)**0.5
c=((x1-x3)**2 + (y1-y3)**2)**0.5
perimeter=a+b+c
p=perimeter/2
area=(p*(p-a)*(p-b)*(p-c))**0.5
print("Периметр треугольника:", perimeter)
print("Площадь треугольника:", area)
